#include "birepresent.h"
#include <stdio.h>

void test2to10()
{
    int b17[] = { 0, 0, 0, 1, 0, 0, 0, 1 };
    if (From2To10(b17) != 17) {
        printf("неверный перевод положительного числа в десятичную систему");
    }
    int bm43[] = { 1, 1, 0, 1, 0, 1, 0, 1 };
    if (From2To10(bm43) != -43) {
        printf("неверный перевод отрицательного числа в десятичную систему");
    }
    int b0[] = { 0, 0, 0, 0, 0, 0, 0, 0 };
    if (From2To10(b0) != 0) {
        printf("неверный перевод нуля в десятичную систему");
    }
}

void test10to2()
{
    int b17n[] = { 0, 0, 0, 0, 0, 0, 0, 0 };
    int bm43n[] = { 0, 0, 0, 0, 0, 0, 0, 0 };
    int b0n[] = { 0, 0, 0, 0, 0, 0, 0, 0 };
    int b17[] = { 0, 0, 0, 1, 0, 0, 0, 1 };
    int bm43[] = { 1, 1, 0, 1, 0, 1, 0, 1 };
    int b0[] = { 0, 0, 0, 0, 0, 0, 0, 0 };
    From10To2(b17n, 8, 17);
    From10To2(bm43n, 8, -43);
    From10To2(b0n, 8, 0);
    for (int i = 0; i < 8; i++) {
        if (b17[i] != b17n[i]) {
            printf("неверный перевод положительного числа в двоичную систему");
        }
        if (bm43[i] != bm43n[i]) {
            printf("неверный перевод отрицательного числа в двоичную систему");
        }
        if (b0[i] != b0n[i]) {
            printf("неверный перевод 0 в двоичную систему");
        }
    }
}

void testSumma()
{
    int b17[] = { 0, 0, 0, 1, 0, 0, 0, 1 };
    int bm43[] = { 1, 1, 0, 1, 0, 1, 0, 1 };
    int r[] = { 0, 0, 0, 0, 0, 0, 0, 0 };
    summa(b17, bm43, r);
    int rr[] = { 1, 1, 1, 0, 0, 1, 1, 0 };
    for (int i = 0; i < 8; i++) {
        if (rr[i] != r[i]) {
            printf("неверное суммирование");
        }
    }
}

void main()
{
    test10to2();
    test2to10();
    testSumma();
    printf("тесты завершены");
}
